Nevermind, the above doesn't work either. We instead get:
```
  # azuresql_permission.lfa-pubapi["select"] must be replaced
-/+ resource "azuresql_permission" "lfa-pubapi" {
      ~ database   = "sqlserver::wildnet-mssqlsrvr-tst:1433:my-mssqldb" # forces replacement -> (known after apply) # forces replacement
      ~ id         = "sqlserver::wildnet-mssqlsrvr-tst:1433:my-mssqldb/permission/13/select/schema/15" -> (known after apply)
      ~ principal  = "sqlserver::wildnet-mssqlsrvr-tst:1433:my-mssqldb/user/13" # forces replacement -> (known after apply) # forces replacement
      ~ scope      = "sqlserver::wildnet-mssqlsrvr-tst:1433:my-mssqldb/schema/15" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }
```
so if the service principal is missing permissions to create the user in SQL server, subsequent `terraform plan` operations run as that user will cause the user to be deleted and recreated with the above approach. I don't yet understand why. We have regular users, who can access AD, but neither our service principals or our SQL servers are able to, yet. 

I am fighting for the right permissions in our constrained environment but it looks like my workaround was a failure. I'll try to figure out why it's killing off the permissions in the interim.